рейс("1", "Москва", time(12, 30), ежедн).
рейс("2", "Питер", time(15, 40), нечет).
рейс("3", "Новосибирск", time(12, 30), чет).
рейс("4", "Саратов", time(16, 14), ежедн).
рейс("5", "Ижевск", time(23, 50), нечет).
рейс("6", "Коломна", time(22, 40), чет).
рейс("7", "Новгород", time(05, 22), нечет).
рейс("8", "Астрахань", time(14, 40), чет).

все_рейсы(Номер, Город, Время, Дни):- рейс(Номер, Город, Время, Дни), 
    write(рейс(Номер, Город, Время, Дни)), nl, fail.

чет_рейсы(Номер, Город, Время):- рейс(Номер, Город, Время, чет), 
    write(Номер), write(' '), write(Город), write(' '), write(Время), nl, fail.

не_позже(time(A_HH, A_MM), time(B_HH, B_MM)):-
    A_HH < B_HH, !;
    A_HH = B_HH, A_MM < B_MM; A_MM = B_MM.

ежедн_рейсы(Номер, Город, Время):- рейс(Номер, Город, Время2, ежедн), не_позже(Время2, Время),  
    write(Номер), write(' '), write(Город), write(' '), write(Время2), nl, fail.
